In [10]:
import numpy as np
import pandas as pd

data_one = {'A':['A0', 'A1', 'A2', 'A3'], 'B':['B0', 'B1', 'B2', 'B3']}
data_two = {'C':['C0', 'C1', 'C2', 'C3'], 'D':['D0', 'D1', 'D2', 'D3']}
data_three = {'E':['C0', 'C5', 'C6', 'C3'], 'D':['D3', 'D5', 'D2', 'D8']}

In [11]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)
three = pd.DataFrame(data_three)

In [3]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [4]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [9]:
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [12]:
three

    E   D
0  C0  D3
1  C5  D5
2  C6  D2
3  C3  D8

In [23]:
pd.merge(two,three,how='inner', on='D')

    C   D   E
0  C2  D2  C6
1  C3  D3  C0

In [26]:
pd.merge(two,three, how='right', on='D')

     C   D   E
0   C3  D3  C0
1  NaN  D5  C5
2   C2  D2  C6
3  NaN  D8  C3